In [33]:
import pandas as pd
from pathlib import Path

In [34]:
Budget_data = Path(r'C:\Users\TribThapa\Desktop\Thapa\ResearchFellow\Courses\FinTech_Bootcamp_MonashUni2021\monu-mel-virt-fin-pt-05-2021-u-c\Homework\Week 2\Instructions\PyBank\Resources\budget_data.csv')

Budget_data_df = pd.read_csv(Budget_data)
Budget_data_df.head(10)

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503
5  Jun-2010         522857
6  Jul-2010        1033096
7  Aug-2010         604885
8  Sep-2010        -216386
9  Oct-2010         477532

In [35]:
Budget_data_df['Shift'] = Budget_data_df['Profit/Losses'].shift()
Budget_data_df.head()

       Date  Profit/Losses     Shift
0  Jan-2010         867884       NaN
1  Feb-2010         984655  867884.0
2  Mar-2010         322013  984655.0
3  Apr-2010         -69417  322013.0
4  May-2010         310503  -69417.0

In [36]:
Budget_data_df['Difference'] = Budget_data_df['Profit/Losses'] - Budget_data_df['Shift']
Budget_data_df.head()

       Date  Profit/Losses     Shift  Difference
0  Jan-2010         867884       NaN         NaN
1  Feb-2010         984655  867884.0    116771.0
2  Mar-2010         322013  984655.0   -662642.0
3  Apr-2010         -69417  322013.0   -391430.0
4  May-2010         310503  -69417.0    379920.0

In [37]:
Budget_data_df['Difference'].mean()

-2315.1176470588234

In [38]:
Budget_data_df.shape[0]

86

In [39]:
Budget_data_df.set_index('Date', inplace=True)
Budget_data_df.head()

          Profit/Losses     Shift  Difference
Date
Jan-2010         867884       NaN         NaN
Feb-2010         984655  867884.0    116771.0
Mar-2010         322013  984655.0   -662642.0
Apr-2010         -69417  322013.0   -391430.0
May-2010         310503  -69417.0    379920.0

In [40]:
a = Budget_data_df['Difference'].idxmax() #index of the max diff in the Diff col.
a

'Feb-2012'

In [41]:
b = Budget_data_df['Difference'].idxmin()
b

'Sep-2013'

In [42]:
#apply loc fun
Budget_data_df.loc[a,'Difference']

1926159.0

In [43]:
#apply loc fun
Budget_data_df.loc[b,'Difference']

-2196167.0